Revit 2027 API
ParameterTypeId.CarbonMaterialParamCategoryId Property
 "Carbon Category ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CarbonMaterialParamCategoryId { get; }
Public Shared ReadOnly Property CarbonMaterialParamCategoryId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CarbonMaterialParamCategoryId {
	ForgeTypeId^ get ();
}
static member CarbonMaterialParamCategoryId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace